// Массив с комплиментами
const compliments = [
    "Ти як сонце, яке освітлює мій день.",
    "Твоя посмішка – це найкраща частина мого дня.",
    "Ти завжди така чарівна, я не можу відвести від тебе погляду.",
    "Твоя краса просто неймовірна, ти як зірка.",
    "Ти надихаєш мене ставати кращим кожного дня.",
    "Твоя доброта і тепло змушують мене почуватися особливим.",
    "Твоя енергія просто неймовірна, ти заряджаєш всіх навколо.",
    "У твоїх очах можна втопити, вони такі глибокі й загадкові.",
    "Твоя сміх – найкраща музика для моїх вух.",
    "У тебе такий приємний голос, хочеться слухати тебе безкінечно.",
    "Ти маєш неперевершений стиль і завжди виглядаєш бездоганно.",
    "Ти випромінюєш таку теплоту і доброту, що хочеться бути поруч.",
    "Твоя інтелігентність і мудрість просто вражають.",
    "Коли ти поруч, весь світ здається яскравішим.",
    "Твоя здатність підтримувати розмову і завжди бути цікавою – це справжній талант.",
    "Ти завжди вмієш зробити навіть найпростіший день особливим.",
    "Кожен момент з тобою — це справжня радість.",
    "Твоя краса ніби вічна, як природна гармонія.",
    "Мені подобається, як ти думаєш, твоя мудрість захоплює.",
    "Ти така чарівна, що слова не здатні передати всю твою красу.",
    "Ти вмієш слухати і розуміти, це рідкісна риса.",
    "Ти, немов яскрава зірка, яка сяє навіть у темряві.",
    "Ти – особлива.",
    "Твоя харизма та чарівність не мають меж.",
    "Ти — найкраща частина мого дня.",
    "Кожен момент з тобою – це справжній подарунок долі.",
    "Ти – це гармонія краси і розуму.",
    "Ти — це ціла вселена, в якій є все: краса, розум, доброта.",
    "Ти надихаєш на нові звершення і цілі.",
];

// Элементы страницы
const complimentText = document.getElementById("compliment");
const generateButton = document.getElementById("generateButton");
const resetButton = document.getElementById("resetButton");

// Функция для генерации случайного комплимента
function generateCompliment() {
    const randomIndex = Math.floor(Math.random() * compliments.length);
    complimentText.textContent = compliments[randomIndex];
}

// Функция для сброса комплиментов
function resetCompliments() {
    complimentText.textContent = "Масив було скинуто. Натиcни 'Генерувати' щоб відобразився новий комплімент";
}

// Обработчики событий
generateButton.addEventListener("click", generateCompliment);
resetButton.addEventListener("click", resetCompliments);
